{
  "common_puns": [
    "Why don't witches wear panties? So they can get a better grip on the broom!",
    "I'm light as a feather, and I can see you're stiff as a board.",
    "What do you call a ghost's favorite type of music? Soul music!",
    "Why did the vampire break up with his girlfriend? She wasn't his type. (He's O-positive)",
    "What's a ghost's favorite type of candy? Boo-berry!",
    "Why don't ghosts ever win at poker? Because you can see right through them!",
    "What do you call a witch who lives at the beach? A sand-witch!",
    "Why did the skeleton go to the party alone? Because he had no body to go with!",
    "What's a vampire's favorite fruit? A blood orange!",
    "Why are skeletons so calm? Because nothing gets under their skin."
  ],
  
  "halloween_pickup_lines": [
    "Are you a witch? Because you've cast a spell on me!",
    "Forget the candy, I want a taste of you.",
    "That costume would look even better on my bedroom floor.",
    "Are you a ghost? Because you've been haunting my dreams all night.",
    "I'm not a vampire, but I'm a real sucker for you.",
    "Is your name Casper? Because you're the friendliest ghost I've ever met!",
    "Are you a werewolf? Because you're making me howl with desire!",
    "Is your name Frankenstein? Because you're electrifying!",
    "I've got a treat for you, and it's not in my candy bag.",
    "Are you a pumpkin? Because I'd love to get you smashed tonight."
  ],
  
  "nsfw_puns": [
    "Why don't witches wear panties? So they can get a better grip on the broom!",
    "What's a ghost's favorite position? The Ghoul-friend experience.",
    "That's a nice costume. Can I talk you out of it?",
    "I'd love to be the ghost that gets to haunt your bed.",
    "What do you call a horny vampire? A neck-romancer.",
    "Are you a pumpkin? 'Cause I'd love to scoop you out.",
    "I'm a vampire, and I want to suck more than just your blood.",
    "Skeletons are great in bed. They are all bone.",
    "I can make you scream louder than any horror movie.",
    "My magic wand is ready, if you know what I mean."
  ],
  
  "ending_types": {
    "romantic": "浪漫結局",
    "funny": "搞笑結局", 
    "sexy": "性感結局",
    "mysterious": "神秘結局",
    "friendship": "友誼結局",
    "adventure": "冒險結局",
    "magical": "魔法結局",
    "spooky": "恐怖結局",
    "eternal": "永恆結局"
  },
  
  "character_types": {
    "witch": "女巫",
    "ghost": "鬼魂",
    "vampire": "吸血鬼",
    "werewolf": "狼人",
    "zombie": "殭屍",
    "skeleton": "骷髏",
    "demon": "惡魔",
    "cat_girl": "貓女",
    "cat": "黑貓",
    "pumpkin": "南瓜"
  },
  
  "locations": {
    "haunted_house": "鬼屋",
    "pumpkin_patch": "南瓜田",
    "graveyard": "墓地",
    "witch_cottage": "女巫小屋",
    "vampire_castle": "吸血鬼城堡",
    "vampire_chamber": "吸血鬼寢宮",
    "werewolf_forest": "狼人森林",
    "zombie_apocalypse": "殭屍末日",
    "skeleton_dungeon": "骷髏地牢",
    "demon_realm": "惡魔領域"
  },
  
  "achievements": {
    "magic_knight": "魔法騎士",
    "moonlight_lover": "月光戀人", 
    "ghost_lover": "鬼魂戀人",
    "pumpkin_master": "南瓜大師",
    "field_lover": "田野戀人",
    "cat_friend": "貓咪之友",
    "cat_tamer": "馴貓師",
    "new_ghost": "新鬼魂",
    "soul_mate": "心靈伴侶",
    "passion_lover": "激情戀人",
    "broom_rider": "掃帚騎士",
    "vampire_bride": "血色新娘"
  }
}